<a href="https://colab.research.google.com/github/saumyamishra1211/saumyamishra1211/blob/main/Pandas_Project_1_(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df =  pd.read_csv('Titanic-Dataset.csv')

In [ ]:
#titanic-
#survived - 0 - means person is not survived
#survived - 1- person is survived

In [ ]:
#first five rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#last five rows

In [ ]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
#shape- total no of rows, total no columns

In [ ]:
df.shape

(891, 12)

In [ ]:
#list all the columns in the data

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
#data types of all the columns

In [ ]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
#problem statement - we want to predict whether passenger have survived or no

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
#descriptive stats
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Create a dataframe

In [ ]:
df2 = pd.DataFrame()

In [ ]:
df2.head()

NameError: name 'df2' is not defined

In [ ]:
student = {'Name' : ['A', 'B', 'C'], 'Age' : [24,18,17], 'Roll' : [1,2,3]}

In [ ]:
df_student = pd.DataFrame(student)

In [ ]:
df_student

  Name  Age  Roll
0    A   24     1
1    B   18     2
2    C   17     3

## Treating the Null values

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#on a particular column
df['Age'].isnull().sum()

177

In [ ]:
df['Age'].mean()

29.69911764705882

In [ ]:
#Impute the null values
df['Age'].fillna(df['Age'].mean(), inplace = True)
df['Age'].isnull().sum()

0

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Types of Encoding
- 1) label encoding
- 2) Ordinal encoding
- 3) One hot encoding

In [ ]:
def square(n):
    return n ** 2

In [ ]:
square(3)

9

In [ ]:
square = lambda n: n ** 2

In [ ]:
square(3)

9

In [ ]:
#lambda function we want to find maximum no between two numbers

In [ ]:
maximum = lambda x,y: x if x > y else y

In [ ]:
maximum(3,13)

13

In [ ]:
#create a lambda function to add the two list

In [ ]:
List1 = [2,4,9]
List2 = [3,8,5]

result = list(map(lambda x,y : x+y, List1, List2))

In [ ]:
result

[5, 12, 14]

## Lamda function
- Anonymous function
- you can pass any number of arguments
- syntax - lambda arguments : expression

In [ ]:
# add 10 to argument a and return the result

In [ ]:
x = lambda a : a + 10

In [ ]:
print(x(5))

15

In [ ]:
#multiple argument a with argument b and return the result
x = lambda a,b : a*b
print(x(5,6))

30

In [ ]:
#add argument a,b,c and return the result
x = lambda a,b,c : a+b+c
print(x(4,5,7))

16

### I want to create a function which always doubles the number that we pass

In [ ]:
def abc(n):
    return lambda a: a * n

myfunc = abc(2)

myfunc(11)

22

In [ ]:
"hello"

'hello'

In [ ]:
print('hello')

hello

In [ ]:
a = 2
a

2

In [ ]:
print(a)

2

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#find the last name and first name from Name column

In [ ]:
df['Last Name'] = df['Name'].apply(lambda x: x.split(',')[0])

In [ ]:
df["first_name"] = df['Name'].apply(lambda x: ' '.join(x.split(',')[1:]))

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

## Deleting Columns

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,first_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

In [ ]:
df = df.drop(['PassengerId'],axis = 1)
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,first_name
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

## Renaming columns

In [ ]:
df = df.rename(columns = {'Sex' : 'Gender', 'Name' : 'Full Name', 'Last Name' : 'Surname',
              'first_name' : 'Name'})

In [ ]:
df.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

## slicing and dicing (Indexing)

In [ ]:
df_third_class = df[df['Pclass'] == 3]

In [ ]:
df_third_class.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
0,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
2,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
4,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry
5,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,NaN,Q,Moran,Mr. James
7,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S,Palsson,Master. Gosta Leonard

In [ ]:
#female with age > 60

In [ ]:
df_aged = df[(df['Age'] > 60) & (df["Gender"] == "female")]
df_aged.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
275,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,Andrews,Miss. Kornelia Theodosia
483,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S,Turkula,Mrs. (Hedwig)
829,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN,Stone,Mrs. George Nelson (Martha Evelyn)

In [ ]:
#Age, Pclass, Gender

In [ ]:
df.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

In [ ]:
df1 = df[['Age', 'Pclass', 'Gender']]
df1.head()

    Age  Pclass  Gender
0  22.0       3    male
1  38.0       1  female
2  26.0       3  female
3  35.0       1  female
4  35.0       3    male

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Survived   891 non-null    int64
 1   Pclass     891 non-null    int64
 2   Full Name  891 non-null    object
 3   Gender     891 non-null    object
 4   Age        891 non-null    float64
 5   SibSp      891 non-null    int64
 6   Parch      891 non-null    int64
 7   Ticket     891 non-null    object
 8   Fare       891 non-null    float64
 9   Cabin      204 non-null    object
 10  Embarked   889 non-null    object
 11  Surname    891 non-null    object
 12  Name       891 non-null    object
dtypes: float64(2), int64(4), object(7)
memory usage: 90.6+ KB

In [ ]:
df.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

In [ ]:
#select numerical columns only
numerics = ['int16', 'int32', 'int64', 'float16', 'float32', 'float64']

df_num = df.select_dtypes(include = numerics)

In [ ]:
df_num.head()

   Survived  Pclass   Age  SibSp  Parch     Fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

## Categorical columns

In [ ]:
df_cat = df.select_dtypes(include = ['object'])
df_cat.head()

,Full Name,Gender,Ticket,Cabin,Embarked,Surname,Name
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S,Braund,Mr. Owen Harris
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S,Heikkinen,Miss. Laina
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,"Allen, Mr. William Henry",male,373450,NaN,S,Allen,Mr. William Henry

## Slicing using ILOC and LOC

In [ ]:
df.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

In [ ]:
#first 100 rows and all the columns

In [ ]:
df2 = df.iloc[:100, :]
df2

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
0,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,0,3,"Shorney, Mr. Charles Joseph",male,29.699118,0,0,374910,8.0500,NaN,S,Shorney,Mr. Charles Joseph
96,0,1,"Goldschmidt, Mr. George B",male,71.000000,0,0,PC 17754,34.6542,A5,C,Goldschmidt,Mr. George B
97,1,1,"Greenfield, Mr. William Bertram",male,23.000000,0,1,PC 17759,63.3583,D10 D12,C,Greenfield,Mr. William Bertram
98,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.000000,0,1,231919,23.0000,NaN,S,Doling,Mrs. John T (Ada Julia Bone)
99,0,2,"Kantor, Mr. Sinai",male,34.000000,1,0,244367,26.0000,NaN,S,Kantor,Mr. Sinai

In [ ]:
#First 250 rows with a subset of columns

df_sub2 = df.iloc[:250, [1,8]]
df_sub2

     Pclass     Fare
0         3   7.2500
1         1  71.2833
2         3   7.9250
3         1  53.1000
4         3   8.0500
..      ...      ...
245       1  90.0000
246       3   7.7750
247       2  14.5000
248       1  52.5542
249       2  26.0000

[250 rows x 2 columns]

In [ ]:
#First 500 rows.
df_sub3 = df.loc[:500, :]

In [ ]:
df_sub3

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
0,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...
496,1,1,"Eustis, Miss. Elizabeth Mussey",female,54.000000,1,0,36947,78.2667,D20,C,Eustis,Miss. Elizabeth Mussey
497,0,3,"Shellard, Mr. Frederick William",male,29.699118,0,0,C.A. 6212,15.1000,NaN,S,Shellard,Mr. Frederick William
498,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,C22 C26,S,Allison,Mrs. Hudson J C (Bessie Waldo Daniels)
499,0,3,"Svensson, Mr. Olof",male,24.000000,0,0,350035,7.7958,NaN,S,Svensson,Mr. Olof
500,0,3,"Calic, Mr. Petar",male,17.000000,0,0,315086,8.6625,NaN,S,Calic,Mr. Petar

In [ ]:
#Gender and Age, of age > 50

In [ ]:
df_sub4 = df.loc[(df['Age'] > 50), ['Gender', 'Age']]

In [ ]:
#df.loc[2:5, 4]

In [ ]:
df_sub4

     Gender   Age
6      male  54.0
11   female  58.0
15   female  55.0
33     male  66.0
54     male  65.0
..      ...   ...
820  female  52.0
829  female  62.0
851    male  74.0
857    male  51.0
879  female  56.0

[64 rows x 2 columns]

## Adding a row

In [ ]:
df.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry

In [ ]:
#Adding a row using 'Append' function
row = dict({'Age' : 24, 'Full Name' : 'Peter', 'Survived' : 'Y'})

In [ ]:
df = df.append(row, ignore_index = True)

NameError: name 'df' is not defined

In [ ]:
a = ['a', 'b', 'c']

In [ ]:
a.append('d')

In [ ]:
a

['a', 'b', 'c', 'd']

In [ ]:
df.tail()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
887,1,1.0,"Graham, Miss. Margaret Edith",female,19.000000,0.0,0.0,112053,30.00,B42,S,Graham,Miss. Margaret Edith
888,0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1.0,2.0,W./C. 6607,23.45,NaN,S,Johnston,"Miss. Catherine Helen ""Carrie"""
889,1,1.0,"Behr, Mr. Karl Howell",male,26.000000,0.0,0.0,111369,30.00,C148,C,Behr,Mr. Karl Howell
890,0,3.0,"Dooley, Mr. Patrick",male,32.000000,0.0,0.0,370376,7.75,NaN,Q,Dooley,Mr. Patrick
891,Y,NaN,Peter,NaN,24.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
len(df)

892

In [ ]:
row

{'Age': 24, 'Full Name': 'Peter', 'Survived': 'Y'}

In [ ]:
#Adding a new row using LOC
df.loc[len(df.index)] = row
df.tail()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
888,0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1.0,2.0,W./C. 6607,23.45,NaN,S,Johnston,"Miss. Catherine Helen ""Carrie"""
889,1,1.0,"Behr, Mr. Karl Howell",male,26.000000,0.0,0.0,111369,30.00,C148,C,Behr,Mr. Karl Howell
890,0,3.0,"Dooley, Mr. Patrick",male,32.000000,0.0,0.0,370376,7.75,NaN,Q,Dooley,Mr. Patrick
891,Y,NaN,Peter,NaN,24.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
892,Y,NaN,Peter,NaN,24.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
len(df)

893

## Sorting

In [ ]:
len(df.index)

893

In [ ]:
df.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
0,0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,1,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S,Allen,Mr. William Henry

In [ ]:
#sorting by age say in decreasing order
df = df.sort_values(by = ['Age'], ascending = False)

In [ ]:
df.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
630,1,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0.0,0.0,27042,30.0000,A23,S,Barkworth,Mr. Algernon Henry Wilson
851,0,3.0,"Svensson, Mr. Johan",male,74.0,0.0,0.0,347060,7.7750,NaN,S,Svensson,Mr. Johan
96,0,1.0,"Goldschmidt, Mr. George B",male,71.0,0.0,0.0,PC 17754,34.6542,A5,C,Goldschmidt,Mr. George B
493,0,1.0,"Artagaveytia, Mr. Ramon",male,71.0,0.0,0.0,PC 17609,49.5042,NaN,C,Artagaveytia,Mr. Ramon
116,0,3.0,"Connors, Mr. Patrick",male,70.5,0.0,0.0,370369,7.7500,NaN,Q,Connors,Mr. Patrick

## Joins

- Cross
- Inner
- Left
- Right
- Outer

- Lets create 2 separate dataframes and try all 5(cross, Inner, left, right and outer joins).

In [ ]:
abc = np.random.randint(10, size = 10)

In [ ]:
abc

array([3, 3, 6, 4, 6, 2, 4, 3, 6, 9])

In [ ]:
sno = [i+1 for i in range(100)]
marks = np.random.randint(100, size = 100)
print(len(marks))
marks_df = pd.DataFrame({'Sno' : sno, 'Marks' : marks})
marks_df.head()

100

   Sno  Marks
0    1     92
1    2     14
2    3      1
3    4     40
4    5     34

In [ ]:
sno = [i+1 for i in range(100)]
age = np.random.randint(100, size = 100)
print(len(marks))
age_df = pd.DataFrame({'Sno' : sno, 'Age' : age})
age_df.head()

100

   Sno  Age
0    1   91
1    2   30
2    3    1
3    4   34
4    5   90

## Cross Join

In [ ]:
cross_join = pd.merge(marks_df, age_df, how = 'cross')
cross_join.head()

   Sno_x  Marks  Sno_y  Age
0      1     92      1   91
1      1     92      2   30
2      1     92      3    1
3      1     92      4   34
4      1     92      5   90

In [ ]:
cross_join.shape

(10000, 4)

## Inner Join

In [ ]:
## Let us see the Inner join now

In [ ]:
marks_df

    Sno  Marks
0     1     92
1     2     14
2     3      1
3     4     40
4     5     34
..  ...    ...
95   96     44
96   97     86
97   98     98
98   99     42
99  100      0

[100 rows x 2 columns]

In [ ]:
age_df

    Sno  Age
0     1   91
1     2   30
2     3    1
3     4   34
4     5   90
..  ...  ...
95   96   84
96   97   74
97   98   49
98   99   50
99  100   46

[100 rows x 2 columns]

In [ ]:
inner_join = pd.merge(marks_df, age_df, how = 'inner')
inner_join.head()

   Sno  Marks  Age
0    1     92   91
1    2     14   30
2    3      1    1
3    4     40   34
4    5     34   90

In [ ]:
inner_join.shape

(100, 3)

## Common records from both the dataframes

In [ ]:
outer_join = pd.merge(marks_df, age_df, how = 'outer')
outer_join.head()

   Sno  Marks  Age
0    1     92   91
1    2     14   30
2    3      1    1
3    4     40   34
4    5     34   90

In [ ]:
outer_join.shape

(100, 3)

In [ ]:
sno = [i+1 for i in range(50)]
marks = np.random.randint(100, size = 50)
print(len(marks))
marks_df1 = pd.DataFrame({'Sno' : sno, 'Marks' : marks})
marks_df1.head()

50

   Sno  Marks
0    1     75
1    2      8
2    3     50
3    4     60
4    5     56

In [ ]:
sno = [i+1 for i in range(100)]
age = np.random.randint(100, size = 100)
print(len(age))
age_df2 = pd.DataFrame({'Sno' : sno, 'Age' : age})
age_df2.head()

100

   Sno  Age
0    1   46
1    2   30
2    3   97
3    4   15
4    5    7

In [ ]:
inner_join1 = pd.merge(marks_df1, age_df2, how = 'inner')
inner_join1.head()

   Sno  Marks  Age
0    1     75   46
1    2      8   30
2    3     50   97
3    4     60   15
4    5     56    7

In [ ]:
inner_join1.shape

(50, 3)

In [ ]:
outer_join1 = pd.merge(marks_df1, age_df2, how = 'outer')
outer_join1.head()

   Sno  Marks  Age
0    1   75.0   46
1    2    8.0   30
2    3   50.0   97
3    4   60.0   15
4    5   56.0    7

In [ ]:
outer_join1.shape

(100, 3)

In [ ]:
age_df.loc[len(age_df.index)] = {'Sno' : 101, 'Age' : 23}
age_df.loc[len(age_df.index)] = {'Sno' : 102, 'Age' : 27}
age_df.loc[len(age_df.index)] = {'Sno' : 103, 'Age' : 29}
age_df.loc[len(age_df.index)] = {'Sno' : 104, 'Age' : 32}
age_df.loc[len(age_df.index)] = {'Sno' : 105, 'Age' : 53}

NameError: name 'age_df' is not defined

In [ ]:
age_df.shape

(105, 2)

In [ ]:
marks_df.shape

(100, 2)

In [ ]:
#left join

In [ ]:
left_join = pd.merge(age_df, marks_df, how = 'left', on = 'Sno')
print(left_join.shape)

(105, 3)

In [ ]:
left_join.shape

(105, 3)

In [ ]:
right_join = pd.merge(age_df, marks_df, how = 'right', on = 'Sno')
print(right_join.shape)

(100, 3)

In [ ]:
right_join.shape

(100, 3)

## Groupby

In [ ]:
df.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
630,1,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0.0,0.0,27042,30.0000,A23,S,Barkworth,Mr. Algernon Henry Wilson
851,0,3.0,"Svensson, Mr. Johan",male,74.0,0.0,0.0,347060,7.7750,NaN,S,Svensson,Mr. Johan
96,0,1.0,"Goldschmidt, Mr. George B",male,71.0,0.0,0.0,PC 17754,34.6542,A5,C,Goldschmidt,Mr. George B
493,0,1.0,"Artagaveytia, Mr. Ramon",male,71.0,0.0,0.0,PC 17609,49.5042,NaN,C,Artagaveytia,Mr. Ramon
116,0,3.0,"Connors, Mr. Patrick",male,70.5,0.0,0.0,370369,7.7500,NaN,Q,Connors,Mr. Patrick

In [ ]:
XYZ = df.groupby(['Pclass'])

In [ ]:
df['Pclass'].value_counts()

3.0    491
1.0    216
2.0    184
Name: Pclass, dtype: int64

In [ ]:
XYZ.get_group(3)

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
851,0,3.0,"Svensson, Mr. Johan",male,74.00,0.0,0.0,347060,7.7750,NaN,S,Svensson,Mr. Johan
116,0,3.0,"Connors, Mr. Patrick",male,70.50,0.0,0.0,370369,7.7500,NaN,Q,Connors,Mr. Patrick
280,0,3.0,"Duane, Mr. Frank",male,65.00,0.0,0.0,336439,7.7500,NaN,Q,Duane,Mr. Frank
483,1,3.0,"Turkula, Mrs. (Hedwig)",female,63.00,0.0,0.0,4134,9.5875,NaN,S,Turkula,Mrs. (Hedwig)
326,0,3.0,"Nysveen, Mr. Johan Hansen",male,61.00,0.0,0.0,345364,6.2375,NaN,S,Nysveen,Mr. Johan Hansen
...,...,...,...,...,...,...,...,...,...,...,...,...,...
381,1,3.0,"Nakid, Miss. Maria (""Mary"")",female,1.00,0.0,2.0,2653,15.7417,NaN,C,Nakid,"Miss. Maria (""Mary"")"
164,0,3.0,"Panula, Master. Eino Viljami",male,1.00,4.0,1.0,3101295,39.6875,NaN,S,Panula,Master. Eino Viljami
469,1,3.0,"Baclini, Miss. Helene Barbara",female,0.75,2.0,1.0,2666,19.2583,NaN,C,Baclini,Miss. Helene Barbara
644,1,3.0,"Baclini, Miss. Eugenie",female,0.75,2.0,1.0,2666,19.2583,NaN,C,Baclini,Miss. Eugenie
803,1,3.0,"Thomas, Master. Assad Alexander",male,0.42,0.0,1.0,2625,8.5167,NaN,C,Thomas,Master. Assad Alexander

In [ ]:
XYZ.get_group(2)

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
672,0,2.0,"Mitchell, Mr. Henry Michael",male,70.00,0.0,0.0,C.A. 24580,10.5000,NaN,S,Mitchell,Mr. Henry Michael
33,0,2.0,"Wheadon, Mr. Edward H",male,66.00,0.0,0.0,C.A. 24579,10.5000,NaN,S,Wheadon,Mr. Edward H
570,1,2.0,"Harris, Mr. George",male,62.00,0.0,0.0,S.W./PP 752,10.5000,NaN,S,Harris,Mr. George
684,0,2.0,"Brown, Mr. Thomas William Solomon",male,60.00,1.0,1.0,29750,39.0000,NaN,S,Brown,Mr. Thomas William Solomon
232,0,2.0,"Sjostedt, Mr. Ernst Adolf",male,59.00,0.0,0.0,237442,13.5000,NaN,S,Sjostedt,Mr. Ernst Adolf
...,...,...,...,...,...,...,...,...,...,...,...,...,...
827,1,2.0,"Mallet, Master. Andre",male,1.00,0.0,2.0,S.C./PARIS 2079,37.0042,NaN,C,Mallet,Master. Andre
183,1,2.0,"Becker, Master. Richard F",male,1.00,2.0,1.0,230136,39.0000,F4,S,Becker,Master. Richard F
78,1,2.0,"Caldwell, Master. Alden Gates",male,0.83,0.0,2.0,248738,29.0000,NaN,S,Caldwell,Master. Alden Gates
831,1,2.0,"Richards, Master. George Sibley",male,0.83,1.0,1.0,29106,18.7500,NaN,S,Richards,Master. George Sibley
755,1,2.0,"Hamalainen, Master. Viljo",male,0.67,1.0,1.0,250649,14.5000,NaN,S,Hamalainen,Master. Viljo

## Average age per Pclass

In [ ]:
df_grp1 = df.groupby(['Pclass'])

In [ ]:
df_grp1['Age'].mean()

Pclass
1.0    37.048118
2.0    29.866958
3.0    26.403259
Name: Age, dtype: float64

In [ ]:
df_grp1['Age'].count()

Pclass
1.0    216
2.0    184
3.0    491
Name: Age, dtype: int64

In [ ]:
#Using agg() function
# we can use the agg function to aggregate results based on some column or our custom condition

In [ ]:
df1 = df.copy()

In [ ]:
df1.head()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Name
630,1,1.0,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0.0,0.0,27042,30.0000,A23,S,Barkworth,Mr. Algernon Henry Wilson
851,0,3.0,"Svensson, Mr. Johan",male,74.0,0.0,0.0,347060,7.7750,NaN,S,Svensson,Mr. Johan
96,0,1.0,"Goldschmidt, Mr. George B",male,71.0,0.0,0.0,PC 17754,34.6542,A5,C,Goldschmidt,Mr. George B
493,0,1.0,"Artagaveytia, Mr. Ramon",male,71.0,0.0,0.0,PC 17609,49.5042,NaN,C,Artagaveytia,Mr. Ramon
116,0,3.0,"Connors, Mr. Patrick",male,70.5,0.0,0.0,370369,7.7500,NaN,Q,Connors,Mr. Patrick

In [ ]:
df1.shape

(893, 13)

In [ ]:
df.shape

(893, 13)

In [ ]:
#average per Pclass using 'AGG' this time
df_grp2 = df.groupby(['Pclass']).agg({'Age' : lambda x: np.mean(x)})
df_grp2.head()

              Age
Pclass
1.0     37.048118
2.0     29.866958
3.0     26.403259

In [ ]:
#Min/Max, count, sum for each Pclass using agg functions
df_grp3 = df.groupby(['Pclass']).agg({'Age': 'min'}).rename(columns = {'Age': 'Min Age'})

In [ ]:
df_grp3.head()

        Min Age
Pclass
1.0        0.92
2.0        0.67
3.0        0.42

In [ ]:
# Names of all the passenger in that class
df_grp4 = df.groupby(['Pclass']).agg({'Name' : lambda x: ', '.join(x)})
df_grp4.head()

                                                     Name
Pclass
1.0      Mr. Algernon Henry Wilson,  Mr. George B,  Mr...
2.0      Mr. Henry Michael,  Mr. Edward H,  Mr. George...
3.0      Mr. Johan,  Mr. Patrick,  Mr. Frank,  Mrs. (H...

In [ ]:
#we can use agg function on a single attribute by providing list in value part

In [ ]:
df_grp5 = df.groupby(['Pclass']).agg({'Age' : ['max', 'min']})
df_grp5.head()

         Age
         max   min
Pclass
1.0     80.0  0.92
2.0     70.0  0.67
3.0     74.0  0.42